Dlubal.RFEM5.HingeSideType
Side where is the hinge placed

Dlubal.RFEM5.HingeSideType.UnknownSideType
Hinge is on unknown side

Dlubal.RFEM5.HingeSideType.NoneSideType
Hinge is on no side

Dlubal.RFEM5.HingeSideType.LeftSideType
Hinge is on the left side

Dlubal.RFEM5.HingeSideType.RightSideType
Hinge is on the right side